# 판다스(pandas)

In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.0 MB 11.1 MB/s eta 0:00:01
   ---------------- ----------------------- 4.5/11.0 MB 11.4 MB/s eta 0:00:01
   ------------------------ --------------- 6.8/11.0 MB 11.5 MB/s eta 0:00:01
   --------------------------------- ------ 9.2/11.0 MB 11.6 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 10.9 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, pandas

   ---------------------------------------- 0/2 [pytz]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   ---------------------------------------- 2/2 [pandas]

Successfully installed pandas-2.3.1 pytz-2025.2

In [1]:
import numpy as np
import pandas as pd

In [2]:
# pandas Series
data1 = np.arange(1,6)
print(data1)
data2 = pd.Series(data1)
print(data2)
data2.index, data2.values

[1 2 3 4 5]
0    1
1    2
2    3
3    4
4    5
dtype: int64

(RangeIndex(start=0, stop=5, step=1), array([1, 2, 3, 4, 5]))

In [3]:
data3 = pd.Series([11,22,33,44,55])
data3

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [4]:
dd = {"apple": 4400,"banana": 3500, "kiwi": 2200,"orange": 1700, "mango": 8800}
data4 = pd.Series(dd)
data4

apple     4400
banana    3500
kiwi      2200
orange    1700
mango     8800
dtype: int64

In [5]:
print(type(data4))
data4.name = "과일가격표"
data4.index.name = "과일이름"
data4, data4.index, data4.values
data4

<class 'pandas.core.series.Series'>

과일이름
apple     4400
banana    3500
kiwi      2200
orange    1700
mango     8800
Name: 과일가격표, dtype: int64

In [6]:
data2.index = ["aa","bb","cc","dd","ee"] # 개수가 같아야 함
data2, data2.index, data2.values

(aa    1
 bb    2
 cc    3
 dd    4
 ee    5
 dtype: int64,
 Index(['aa', 'bb', 'cc', 'dd', 'ee'], dtype='object'),
 array([1, 2, 3, 4, 5]))

In [7]:
# 판다스 시리즈 데이터 타입
data5 = pd.Series(np.arange(1,7), dtype = "float",index = ["aa","bb","cc","dd","ee","ff"])
data5, data5.shape, data5.size, data5.ndim

(aa    1.0
 bb    2.0
 cc    3.0
 dd    4.0
 ee    5.0
 ff    6.0
 dtype: float64,
 (6,),
 6,
 1)

In [12]:
# 시리즈 원소에 접근방법
print(data5)
print("data5['dd']:",data5['dd'])
print("data5.loc['dd']",data5.loc['dd'])
print("data5[3]", data5[3]) # deprecated
print("data5.iloc[3]:", data5.iloc[3])

aa    1.0
bb    2.0
cc    3.0
dd    4.0
ee    5.0
ff    6.0
dtype: float64
data5['dd']: 4.0
data5.loc['dd'] 4.0
data5[3] 4.0
data5.iloc[3]: 4.0

C:\Users\user\AppData\Local\Temp\ipykernel_18944\2873129448.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("data5[3]", data5[3]) # deprecated

# Data Frame

In [14]:
import pandas as pd
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=["a","b","c"], columns=["A","B","c"])
df

   A  B  c
a  1  2  3
b  4  5  6
c  7  8  9

In [15]:
num = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(num, index=["a","b","c"], columns=["A","B","c"])
df

   A  B  c
a  1  2  3
b  4  5  6
c  7  8  9

In [16]:
dd = {"과일이름":["apple", "banana","kiwi","melon", "orange","mango"],
      "가격":[4400,5000,2500,7000,2000,8800],
      "개수":[3,8,11,22,6,5]}
df2 = pd.DataFrame(dd)
df2

     과일이름    가격  개수
0   apple  4400   3
1  banana  5000   8
2    kiwi  2500  11
3   melon  7000  22
4  orange  2000   6
5   mango  8800   5

In [17]:
df2.columns.name = "info"
df2.index.name = ''
df2.columns = ['과일이름','원가','수량']
df2

     과일이름    원가  수량

0   apple  4400   3
1  banana  5000   8
2    kiwi  2500  11
3   melon  7000  22
4  orange  2000   6
5   mango  8800   5

In [18]:
df2.describe()

                원가         수량
count     6.000000   6.000000
mean   4950.000000   9.166667
std    2609.022806   6.853223
min    2000.000000   3.000000
25%    2975.000000   5.250000
50%    4700.000000   7.000000
75%    6500.000000  10.250000
max    8800.000000  22.000000

In [19]:
df3 = pd.DataFrame(df2, columns = ['과일이름', '품종','원가','할인','수량','합계'])
df3, df3.dtypes

(     과일이름  품종    원가  할인  수량  합계

 0   apple NaN  4400 NaN   3 NaN
 1  banana NaN  5000 NaN   8 NaN
 2    kiwi NaN  2500 NaN  11 NaN
 3   melon NaN  7000 NaN  22 NaN
 4  orange NaN  2000 NaN   6 NaN
 5   mango NaN  8800 NaN   5 NaN,
 과일이름     object
 품종      float64
 원가        int64
 할인      float64
 수량        int64
 합계      float64
 dtype: object)

In [20]:
# df3["품종"] = df3["품종"].astype('object')
df3.loc[:,'품종'] = df3.loc[:,'품종'].astype('object')
df3.loc[:,'품종'] = ['신선한','궁금한','맛있는','최적의','웰빙','유기농']
df3.loc[:,'할인'] = [0.2,0.3,0.2,0.1,0.2,0.3]
df3

C:\Users\user\AppData\Local\Temp\ipykernel_18944\2862021752.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[nan nan nan nan nan nan]' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df3.loc[:,'품종'] = df3.loc[:,'품종'].astype('object')

     과일이름   품종    원가   할인  수량  합계

0   apple  신선한  4400  0.2   3 NaN
1  banana  궁금한  5000  0.3   8 NaN
2    kiwi  맛있는  2500  0.2  11 NaN
3   melon  최적의  7000  0.1  22 NaN
4  orange   웰빙  2000  0.2   6 NaN
5   mango  유기농  8800  0.3   5 NaN

In [21]:
df3['합계'] = (df3["원가"] * df3["수량"] * (1 - df3["할인"])).astype('int')
df3

     과일이름   품종    원가   할인  수량      합계

0   apple  신선한  4400  0.2   3   10560
1  banana  궁금한  5000  0.3   8   28000
2    kiwi  맛있는  2500  0.2  11   22000
3   melon  최적의  7000  0.1  22  138600
4  orange   웰빙  2000  0.2   6    9600
5   mango  유기농  8800  0.3   5   30799

In [22]:
df3['ETC'] = "-"
df3['Test'] = "test"
print(df3.dtypes)
df3

과일이름     object
품종       object
원가        int64
할인      float64
수량        int64
합계        int64
ETC      object
Test     object
dtype: object

     과일이름   품종    원가   할인  수량      합계 ETC  Test

0   apple  신선한  4400  0.2   3   10560   -  test
1  banana  궁금한  5000  0.3   8   28000   -  test
2    kiwi  맛있는  2500  0.2  11   22000   -  test
3   melon  최적의  7000  0.1  22  138600   -  test
4  orange   웰빙  2000  0.2   6    9600   -  test
5   mango  유기농  8800  0.3   5   30799   -  test

In [23]:
del df3['Test']
df3

     과일이름   품종    원가   할인  수량      합계 ETC

0   apple  신선한  4400  0.2   3   10560   -
1  banana  궁금한  5000  0.3   8   28000   -
2    kiwi  맛있는  2500  0.2  11   22000   -
3   melon  최적의  7000  0.1  22  138600   -
4  orange   웰빙  2000  0.2   6    9600   -
5   mango  유기농  8800  0.3   5   30799   -

In [24]:
ee =pd.Series([1.3,2.2], index=[2,4])
df3['ETC'] = ee
df3 = df3.fillna('')
df3

     과일이름   품종    원가   할인  수량      합계  ETC

0   apple  신선한  4400  0.2   3   10560
1  banana  궁금한  5000  0.3   8   28000
2    kiwi  맛있는  2500  0.2  11   22000  1.3
3   melon  최적의  7000  0.1  22  138600
4  orange   웰빙  2000  0.2   6    9600  2.2
5   mango  유기농  8800  0.3   5   30799

In [25]:
df3['PASS'] = ''
df3

     과일이름   품종    원가   할인  수량      합계  ETC PASS

0   apple  신선한  4400  0.2   3   10560
1  banana  궁금한  5000  0.3   8   28000
2    kiwi  맛있는  2500  0.2  11   22000  1.3
3   melon  최적의  7000  0.1  22  138600
4  orange   웰빙  2000  0.2   6    9600  2.2
5   mango  유기농  8800  0.3   5   30799

In [26]:
pp = np.where(df3['합계']<=30000,'구매각','-')
df3['PASS'] = pp
df3

     과일이름   품종    원가   할인  수량      합계  ETC PASS

0   apple  신선한  4400  0.2   3   10560       구매각
1  banana  궁금한  5000  0.3   8   28000       구매각
2    kiwi  맛있는  2500  0.2  11   22000  1.3  구매각
3   melon  최적의  7000  0.1  22  138600         -
4  orange   웰빙  2000  0.2   6    9600  2.2  구매각
5   mango  유기농  8800  0.3   5   30799         -

In [29]:
df3['DV'] = np.where(df3['수량']>=7,'포장','번들')
df3

     과일이름   품종    원가   할인  수량      합계  ETC PASS  DV

0   apple  신선한  4400  0.2   3   10560       구매각  번들
1  banana  궁금한  5000  0.3   8   28000       구매각  포장
2    kiwi  맛있는  2500  0.2  11   22000  1.3  구매각  포장
3   melon  최적의  7000  0.1  22  138600         -  포장
4  orange   웰빙  2000  0.2   6    9600  2.2  구매각  번들
5   mango  유기농  8800  0.3   5   30799         -  번들

In [36]:
# df3.iloc[1, 1:4]
# df3.loc[2,:]
df3.loc[df3.loc[:,'과일이름'] == 'banana', '품종':'수량']

    품종    원가   할인  수량

1  궁금한  5000  0.3   8

In [35]:
df3

     과일이름   품종    원가   할인  수량      합계  ETC PASS  DV

0   apple  신선한  4400  0.2   3   10560       구매각  번들
1  banana  궁금한  5000  0.3   8   28000       구매각  포장
2    kiwi  맛있는  2500  0.2  11   22000  1.3  구매각  포장
3   melon  최적의  7000  0.1  22  138600         -  포장
4  orange   웰빙  2000  0.2   6    9600  2.2  구매각  번들
5   mango  유기농  8800  0.3   5   30799         -  번들

In [63]:

# df3.loc['1':'5','과일이름':'할인']
# df3.iloc[1:4,0:4]
# df3.iloc[[0,2,4],[0,2,5,7]]
df3.loc[[1,3,5],['과일이름','원가','합계','PASS']]

     과일이름    원가      합계 PASS

1  banana  5000   28000  구매각
3   melon  7000  138600    -
5   mango  8800   30799    -

In [62]:
df3

     과일이름   품종    원가   할인  수량      합계  ETC PASS  DV

0   apple  신선한  4400  0.2   3   10560       구매각  번들
1  banana  궁금한  5000  0.3   8   28000       구매각  포장
2    kiwi  맛있는  2500  0.2  11   22000  1.3  구매각  포장
3   melon  최적의  7000  0.1  22  138600         -  포장
4  orange   웰빙  2000  0.2   6    9600  2.2  구매각  번들
5   mango  유기농  8800  0.3   5   30799         -  번들

In [86]:
import numpy as np
import pandas as pd
print("인구수 시리즈 데이터")
population_dic = {
    'korea':5182,
    'japan':12622,
    'china':141178,
    'usa' :32976
}
print("GDP 시리즈데이터")
GDP_dic = {
    'korea':169320000,
    'japan':516700000,
    'china':140925000,
    'usa':2041280000
}
population = pd.Series(population_dic)
GDP = pd.Series(GDP_dic)
print(population)
print(GDP)
print("-"*30)
print("데이터 프레임 생성")
country = pd.DataFrame({"population":population,"GDP":GDP})
country

인구수 시리즈 데이터
GDP 시리즈데이터
korea      5182
japan     12622
china    141178
usa       32976
dtype: int64
korea     169320000
japan     516700000
china     140925000
usa      2041280000
dtype: int64
------------------------------
데이터 프레임 생성

       population         GDP
korea        5182   169320000
japan       12622   516700000
china      141178   140925000
usa         32976  2041280000

In [87]:
country.loc[['korea'],:]

       population        GDP
korea        5182  169320000

In [88]:
country['GDP_per'] = country['GDP'] / country["population"]
country

       population         GDP       GDP_per
korea        5182   169320000  32674.642995
japan       12622   516700000  40936.460149
china      141178   140925000    998.207936
usa         32976  2041280000  61901.989326

In [89]:
country.loc['india'] = [142222,1505000,1212121]
country

       population         GDP       GDP_per
korea        5182   169320000  3.267464e+04
japan       12622   516700000  4.093646e+04
china      141178   140925000  9.982079e+02
usa         32976  2041280000  6.190199e+04
india      142222     1505000  1.212121e+06

In [92]:
country.loc['africa'] = pd.Series([123456,7777777],index = ["population","GDP"])
country

        population           GDP       GDP_per
korea       5182.0  1.693200e+08  3.267464e+04
japan      12622.0  5.167000e+08  4.093646e+04
china     141178.0  1.409250e+08  9.982079e+02
usa        32976.0  2.041280e+09  6.190199e+04
india     142222.0  1.505000e+06  1.212121e+06
africa    123456.0  7.777777e+06           NaN

In [102]:
country.drop('africa', axis = 0)
# country.drop(country[country.isnull().any(axis=1)].index, axis = 0)
country

        population           GDP       GDP_per
korea       5182.0  1.693200e+08  3.267464e+04
japan      12622.0  5.167000e+08  4.093646e+04
china     141178.0  1.409250e+08  9.982079e+02
usa        32976.0  2.041280e+09  6.190199e+04
india     142222.0  1.505000e+06  1.212121e+06
africa    123456.0  7.777777e+06           NaN